run/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         15;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.25;
maxDeltaT       1;

libs
(
"libwaveGeneration.so"
 "libwaveAbsorption.so"
"libsampling.so"
"libfieldFunctionObjects.so"
"lib6DoFDynamicMeshForcedMotion.so" 
);

functions
{
  /*  floaterMotion
    {
        type           rigidBodyStateWriter;
        libs           (rigidBodyStateWriter);
        writeControl    timeStep;
        writeInterval    1;
    }
     waterVolume
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;
        writeControl    timeStep;
        writeFields     true;
        OutputControl   timeStep;
        OutputInterval   1;
        writeInterval    1;
        regionType          all;
        name                all;
        operation       volIntegrate;
        fields
        (
            alpha.water
        );
    }*/
}

// ************************************************************************* //
